import cv2  # 导入OpenCV库
import numpy as np  # 导入NumPy库

image = np.zeros([350, 350, 3], dtype=np.uint8)  # 创建一个350x350的黑色图像

cv2.line(image, (100, 200), (250, 250), (0, 0, 255), 3)  # 在图像中绘制一条线，起点为(100, 200)，终点为(250, 250)，颜色为红色，线宽为3
cv2.rectangle(image, (100, 100), (300, 300), (0, 255, 0), 3)  # 在图像中绘制一个矩形，左上角坐标为(100, 100)，右下角坐标为(300, 300)，颜色为绿色，线宽为3
cv2.circle(image, (200, 200), 50, (255, 0, 0), 3)  # 在图像中绘制一个圆形，圆心为(200, 200)，半径为50，颜色为蓝色，线宽为3
cv2.putText(image, "Hello, OpenCV", (100, 50), 0, 1, (255, 255, 255), 3, 1)  # 在图像中添加文本，文本为"Hello, OpenCV"，位置为(100, 50)，字体为默认字体，大小为1，颜色为白色，线宽为3

cv2.imshow('image', image)  # 显示图像
cv2.waitKey(0)  # 等待按键，0表示无限等待